<?php

declare(strict_types=1);

namespace app\api\controller;

class SolutionController
{
    function query(): \think\response\Json
    {
        $str = <<<EOF
{
  	"fangan":"增强斜方肌、肩胛提肌、菱形肌、竖脊肌、夹肌、背阔肌的力量",
  	"protureSet":[ 
	  	{ 
	  		"muscleName":"斜方肌",
	  		"posture":[
	  			{
					"postureName":"负重侧上举",
					"startPoint1":"取站立位，双脚迈开，踩实地面，与肩同宽；膝关节自然直立不要过伸；站稳后，双侧手持哑铃（取适宜的重量）与肩同宽自然下垂；抬头挺胸，腰背挺直，腹部收紧",
					"postureContent1":"双手同时向两侧上举并吸气，随后还原并呼气",
					"notice1":"完成上述动作为一组；每组间隔3s，重复10组，为1次；1次/天，每周训练3~4天，持续2~3周；2~3周后根据矫正效果调整哑铃重量",
					"startImg":"xfj_01_01",
					"endImg":"xfj_01_02"
				},
				{
					"postureName":"负重扩胸",
					"startPoint1":"取站立位，双脚迈开，踩实地面，与肩同宽；膝关节自然直立不要过伸；站稳后，双侧手持哑铃（取适宜的重量）与肩同宽自然下垂，逐渐向前方抬起至水平位，此时屈肩90°；抬头挺胸，腰背挺直，腹部收紧",
					"postureContent1":"双手同时向两侧平移完成扩胸并吸气，随后还原并呼气",
					"notice1":"完成上述动作为一组；每组间隔3s，重复10组，为1次；1次/天，每周训练3~4天，持续2~3周；2~3周后根据矫正效果调整哑铃重量",
					"startImg":"xfj_02_01",
					"endImg":"xfj_02_02"
				}
	  		]
		},
		{ 
	  		"muscleName":"背阔肌",
	  		"posture":[
	  			{
					"postureName":"坐位向后拉拉力器（划船动作）",
					"startPoint1":"取坐位于平地上，双侧腿伸直并用脚底抵住拉力器，弓腰向前伸臂，双手紧紧拉住拉力器把手",
					"postureContent1":"两臂同时向后方拉动拉力器并吸气，同时上体后仰、挺胸，要求拉力器把手触及腹部两侧",
					"notice1":"完成上述动作为一组；每组间隔3s，重复10组，为1次；1次/天，每周训练3~4天，持续2~3周",
					"startImg":"bkj_01_01",
					"endImg":"bkj_01_02"
				}
	  		]
		},
		{ 
	  		"muscleName":"夹肌",
	  		"posture":[
	  			{
					"postureName":"负重提拉",
					"startPoint1":"取站立位，双脚迈开，踩实地面，与肩同宽；膝关节自然直立不要过伸；站稳后，双手正握拳握哑铃（或杠铃）放置于躯体前方，两手间距较小；抬头挺胸，腰背挺直，腹部收紧",
					"postureContent1":"双手同时向上提拉哑铃（或杠铃）并吸气，要求达到胸部；随后还原并呼气",
					"notice1":"完成上述动作为一组；每组间隔3s，重复10组，为1次；1次/天，每周训练3~4天，持续2~3周；2~3周后根据矫正效果调整哑铃（或杠铃）重量",
					"startImg":"sjj_01_01",
					"endImg":"sjj_01_02"
				},
				{
					"postureName":"俯卧臂腿上振",
					"startPoint1":"取俯卧位，四肢伸直；双脚张开，屈肩180度，四肢展开都与肩同宽；腰背挺直，腹部收紧",
					"postureContent1":"双腿双臂同时向上后伸并吸气，随后还原并呼气",
					"notice1":"完成上述动作为一组；每组间隔3s，重复10组，为1次；1次/天，每周训练3~4天，持续2~3周",
					"startImg":"sjj_02_01",
					"endImg":"sjj_02_02"
				}
	  		]
		},
		{ 
	  		"muscleName":"肩胛提肌",
	  		"posture":[
	  			{
					"postureName":"负重侧上举",
					"startPoint1":"取站立位，双脚迈开，踩实地面，与肩同宽；膝关节自然直立不要过伸；站稳后，双侧手持哑铃（取适宜的重量）与肩同宽自然下垂；抬头挺胸，腰背挺直，腹部收紧",
					"postureContent1":"双手同时向两侧上举并吸气，随后还原并呼气。",
					"notice1":"完成上述动作为一组；每组间隔3s，重复10组，为1次；1次/天，每周训练3~4天，持续2~3周；2~3周后根据矫正效果调整哑铃重量。",
					"startImg":"xfj_01_01",
					"endImg":"xfj_01_02"
				},
				{
					"postureName":"负重扩胸",
					"startPoint1":"取站立位，双脚迈开，踩实地面，与肩同宽；膝关节自然直立不要过伸；站稳后，双侧手持哑铃（取适宜的重量）与肩同宽自然下垂，逐渐向前方抬起至水平位，此时屈肩90°；抬头挺胸，腰背挺直，腹部收紧",
					"postureContent1":"双手同时向两侧平移完成扩胸并吸气，随后还原并呼气",
					"notice1":"完成上述动作为一组；每组间隔3s，重复10组，为1次；1次/天，每周训练3~4天，持续2~3周；2~3周后根据矫正效果调整哑铃重量",
					"startImg":"xfj_02_01",
					"endImg":"xfj_02_02"
				}
	  		]
		},
		{ 
	  		"muscleName":"菱形肌",
	  		"posture":[
	  			{
					"postureName":"负重侧上举",
					"startPoint1":"取站立位，双脚迈开，踩实地面，与肩同宽；膝关节自然直立不要过伸；站稳后，双侧手持哑铃（取适宜的重量）与肩同宽自然下垂；抬头挺胸，腰背挺直，腹部收紧",
					"postureContent1":"双手同时向两侧上举并吸气，随后还原并呼气。",
					"notice1":"完成上述动作为一组；每组间隔3s，重复10组，为1次；1次/天，每周训练3~4天，持续2~3周；2~3周后根据矫正效果调整哑铃重量。",
					"startImg":"xfj_01_01",
					"endImg":"xfj_01_02"
				},
				{
					"postureName":"负重扩胸",
					"startPoint1":"取站立位，双脚迈开，踩实地面，与肩同宽；膝关节自然直立不要过伸；站稳后，双侧手持哑铃（取适宜的重量）与肩同宽自然下垂，逐渐向前方抬起至水平位，此时屈肩90°；抬头挺胸，腰背挺直，腹部收紧",
					"postureContent1":"双手同时向两侧平移完成扩胸并吸气，随后还原并呼气",
					"notice1":"完成上述动作为一组；每组间隔3s，重复10组，为1次；1次/天，每周训练3~4天，持续2~3周；2~3周后根据矫正效果调整哑铃重量",
					"startImg":"xfj_02_01",
					"endImg":"xfj_02_02"
				},
				{
					"postureName":"负重耸肩",
					"startPoint1":"取站立位，双脚迈开，踩实地面，与肩同宽；膝关节自然直立不要过伸；站稳后，双手正握拳握哑铃（或杠铃）与肩同宽自然垂下；抬头挺胸，腰背挺直，腹部收紧",
					"postureContent1":"双手保持伸直同时向上耸肩并吸气，随后还原并呼气",
					"notice1":"完成上述动作为一组；每组间隔3s，重复10组，为1次；1次/天，每周训练3~4天，持续2~3周；2~3周后根据矫正效果调整哑铃（或杠铃）重量",
					"startImg":"lxj_03_01",
					"endImg":"lxj_03_02"
				}
	  		]
		},
		{ 
	  		"muscleName":"竖脊肌",
	  		"posture":[
	  			{
					"postureName":"负重提拉",
					"startPoint1":"取站立位，双脚迈开，踩实地面，与肩同宽；膝关节自然直立不要过伸；站稳后，双手正握拳握哑铃（或杠铃）放置于躯体前方，两手间距较小；抬头挺胸，腰背挺直，腹部收紧",
					"postureContent1":"双手同时向上提拉哑铃（或杠铃）并吸气，要求达到胸部；随后还原并呼气",
					"notice1":"完成上述动作为一组；每组间隔3s，重复10组，为1次；1次/天，每周训练3~4天，持续2~3周；2~3周后根据矫正效果调整哑铃（或杠铃）重量",
					"startImg":"sjj_01_01",
					"endImg":"sjj_01_02"
				},
				{
					"postureName":"俯卧臂腿上振",
					"startPoint1":"取俯卧位，四肢伸直；双脚张开，屈肩180度，四肢展开都与肩同宽；腰背挺直，腹部收紧",
					"postureContent1":"双腿双臂同时向上后伸并吸气，随后还原并呼气",
					"notice1":"完成上述动作为一组；每组间隔3s，重复10组，为1次；1次/天，每周训练3~4天，持续2~3周",
					"startImg":"sjj_02_01",
					"endImg":"sjj_02_02"
				}
	  		]
		}	
	]	
  }
EOF;

//        return api_success([
//            "fangan" => "增强斜方肌、肩胛提肌、菱形肌、竖脊肌、夹肌、背阔肌的力量，增强胸大肌、胸小肌、前锯肌的伸展性",
//            "protureSet" => [
//                [
//                    "muscleName" => "斜方肌",
//                    "posture" => [
//                        [
//                            "postureName" => "负重侧上举",
//                            "startPoint1" => [
//                                "取站立位，双脚迈开，踩实地面，与肩同宽；膝关节自然直立不要过伸；站稳后，双侧手持哑铃（取适宜的重量）与肩同宽自然下垂；抬头挺胸，腰背挺直，腹部收紧。",
//                                "取站立位，双脚迈开，踩实地面，与肩同宽；膝关节自然直立不要过伸；站稳后，双侧手持哑铃（取适宜的重量）与肩同宽自然下垂；抬头挺胸，腰背挺直，腹部收紧。"
//                            ],
//                            "notice1" => "完成上述动作为一组；每组间隔3s，重复10组，为1次；1次/天，每周训练3~4天，持续2~3周；2~3周后根据矫正效果调整哑铃重量。",
//                            "startImg" => "",
//                            "endImg" => ""
//                        ]
//                    ]
//                ]
//            ]
//        ]);
        return api_success(json_decode($str));
    }

}